tap "bufbuild/buf"
tap "emqx/mqttx"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "minacle/chntpw"
tap "sidneys/homebrew"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "python@3.12"
brew "asitop"
brew "glib"
brew "at-spi2-core"
brew "bash-completion"
brew "bat"
brew "cabextract"
brew "cairo"
brew "cdrtools"
brew "cloudflared"
brew "cmake"
brew "coturn"
brew "ctags"
brew "curl"
brew "harfbuzz"
brew "node"
brew "emscripten"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@6"
brew "flock"
brew "fping"
brew "gcc"
brew "gh"
brew "git"
brew "gitleaks"
brew "gsettings-desktop-schemas"
brew "go"
brew "gobject-introspection"
brew "grpcurl"
brew "gtk+3"
brew "gtk4"
brew "json-glib"
brew "libsoup"
brew "py3cairo"
brew "pygobject3"
brew "gstreamer"
brew "helm"
brew "htop"
brew "jq"
brew "just"
brew "k3d"
brew "kubecolor"
brew "libpaho-mqtt"
brew "lsd"
brew "media-info"
brew "minikube"
brew "mkcert"
brew "mosquitto"
brew "mpv"
brew "nmap"
brew "openblas"
brew "numpy"
brew "nvm"
brew "openvino"
brew "pipx"
brew "postgresql@14"
brew "pyenv"
brew "python-tk@3.13"
brew "qemu"
brew "qrencode"
brew "ranger"
brew "rust-analyzer"
brew "rustup"
brew "scons"
brew "skaffold"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "upx"
brew "uv"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "wimlib"
brew "x86_64-linux-gnu-binutils"
brew "xclip"
brew "yarn"
brew "yasm"
brew "bufbuild/buf/buf"
brew "emqx/mqttx/mqttx-cli"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform"
brew "minacle/chntpw/chntpw"
brew "sidneys/homebrew/unrar"
cask "claude-code"
cask "codex"
cask "db-browser-for-sqlite"
cask "docker-desktop"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-space-mono-nerd-font"
cask "godot"
cask "google-chrome"
cask "gstreamer-runtime"
cask "ngrok"
cask "openlens"
cask "pgadmin4"
cask "postman"
cask "stats"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "wine-stable"
cask "wireshark-app"
vscode "1yib.rust-bundle"
vscode "42crunch.vscode-openapi"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "guyutongxue.cpp-reference"
vscode "hashicorp.terraform"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.anycode-cpp"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "sclu1034.justfile"
vscode "serayuzgur.crates"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "ton-community.tact-vscode"
vscode "twxs.cmake"
vscode "wayou.vscode-todo-highlight"
vscode "zxh404.vscode-proto3"
go "golang.org/x/tools/gopls"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/golang/mock/mockgen"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/volatiletech/sqlboiler/v4"
go "github.com/volatiletech/sqlboiler/v4/drivers/sqlboiler-mysql"
go "github.com/volatiletech/sqlboiler/v4/drivers/sqlboiler-psql"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/google/wire/cmd/wire"
cargo "avm"
cargo "knockknock"
cargo "magic-pack"
npm "@coral-xyz/anchor-cli"
npm "corepack"
npm "yarn"
